
$(function(){
    var data = [
        { "date": "2019-08-24 09:00:00", "title": "День незалежності України. Вітаємо усіх зі спільним об'єднуючим Святом нації!", "description": "", "url": "" },
        { "date": "2019-08-27 08:00:00", "title": "Відновлення діяльності дитячого клубу повного дня перебування 'Ріккі-Тіккі-Таві'ю", "description": "", "url": "" },
        { "date": "2019-09-01 09:00:20", "title": "День Знань. Вітаємо наших випускників з новим навчальним роком у школі!", "description": "", "url": "" },
        { "date": "2019-09-02 11:00:00", "title": "Зустріч з дошкільнятами. Запрошуємо дітей-школярів на зустріч з дошкільнятами дитячого клубу 'Ріккі-Тіккі-Таві' для привітання, бесіди, естафети.", "description": "", "url": "" },
        
        { "date": "2019-09-09 09:00:00", "title": "Міжнародний день краси. У понеділок проводиметься майстер-клас «Красуня Осінь». Діти-дизайнери створюватимуть вбрання з природного матеріалу.", "description": "", "url": "" },
        { "date": "2019-09-23 09:00:00", "title": "Осіннє рівнодення. У рамках розкриття теми в Монтессорі-зоні «Природа і культура. Космос» буде проведено бесіду та дослід особливості цього дня.", "description": "", "url": "" },
        { "date": "2019-09-27 17:30:00", "title": "Свято Осені. У дитячому клубі о 17:30 буде проведено тематичне свято з батьками.", "description": "", "url": "" },
        { "date": "2019-10-01 09:00:00", "title": "Міжнародний день музики. У вівторок, в присвяті цьому дню, діти виготовлятимуть музичні інструменти та створять власну мелодію шумовим оркестром.", "description": "", "url": "" },
        { "date": "2019-10-11 09:00:00", "title": "З нагоди  Дня українського козацтва та захисника України, що святкується 14 жовтня, відбудеться розвага для дітей у вишиванках, спортивного характеру.", "description": "", "url": "" },
        
        { "date": "2019-11-04 09:00:00", "title": "З нагоди Дня української писемності та мови, що відзначається у суботу 9 листопада, з дітьми, протягом тижня, проводитимуться заняття та виконуватиметься робота за методиками М.Зайцева та М.Монтессорі (виготовлення книжки «Моє ім’я»)", "description": "", "url": "" },
        { "date": "2019-11-05 09:00:00", "title": "З нагоди Дня української писемності та мови, що відзначається у суботу 9 листопада, з дітьми, протягом тижня, проводитимуться заняття та виконуватиметься робота за методиками М.Зайцева та М.Монтессорі (виготовлення книжки «Моє ім’я»)", "description": "", "url": "" },
        { "date": "2019-11-06 09:00:00", "title": "З нагоди Дня української писемності та мови, що відзначається у суботу 9 листопада, з дітьми, протягом тижня, проводитимуться заняття та виконуватиметься робота за методиками М.Зайцева та М.Монтессорі (виготовлення книжки «Моє ім’я»)", "description": "", "url": "" },
        { "date": "2019-11-07 09:00:00", "title": "З нагоди Дня української писемності та мови, що відзначається у суботу 9 листопада, з дітьми, протягом тижня, проводитимуться заняття та виконуватиметься робота за методиками М.Зайцева та М.Монтессорі (виготовлення книжки «Моє ім’я»)", "description": "", "url": "" },
        { "date": "2019-11-08 09:00:00", "title": "З нагоди Дня української писемності та мови, що відзначається у суботу 9 листопада, з дітьми, протягом тижня, проводитимуться заняття та виконуватиметься робота за методиками М.Зайцева та М.Монтессорі (виготовлення книжки «Моє ім’я»)", "description": "", "url": "" },
        
        { "date": "2019-11-15 09:00:00", "title": "16 листопада, відзначається «Всесвітній День ґудзиків». У клубі «Ріккі-Тіккі-Таві» з нагоди цього дня з дітьми буде проводитиметься майстер-клас з виготовлення листівки з прикрасою ґудзиками", "description": "", "url": "" },
        
        { "date": "2019-12-06 09:00:00", "title": "У п’ятницю, 6 грудня, День Збройних сил України. З нагоди цього особливого дня буде проведено розвагу для дітей із привітанням.", "description": "", "url": "" },
        { "date": "2019-12-13 09:00:00", "title": "З нагоди Міжнародного дня чаю, що має фіксовану дату 15 грудня, у п’ятницю 13.12.2019 відбудеться пригощання дітьми однолітків у процесі чаювання.", "description": "", "url": "" },
        { "date": "2019-12-19 09:00:00", "title": "День Святого Миколая. У цей особливий день, у четвер, відбудеться розвага для дітей з врученням подарунків від Миколайчика.", "description": "", "url": "" },
        { "date": "2019-12-20 09:00:00", "title": "У вечірній час п’ятниці, о 17:30, запрошуємо батьків дітей на святкування. Для прощання з роком, що минає та зустрічі Нового року запрошуємо на Свято Зими!", "description": "", "url": "" },
        
        { "date": "2020-06-21 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-22 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-23 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-24 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-25 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-26 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        { "date": "2020-06-27 09:00:00", "title": "Тиждень \"Родина\" З нагоди Дня Тата, що відбудеться у суботу 21 червня, протягом тижня, напередодні цього дня, діти виготовлятимуть листівки членів сім'ї, проводитимуться бесіди, ігри та розучування пісень", "description": "", "url": "" },
        
        { "date": "2020-06-22 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-23 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-24 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-25 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-26 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-27 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-28 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-29 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        { "date": "2020-06-30 09:00:00", "title": "22-30 червня Тиждень безпеки (комахи) Цього тижня діти виготовлятимуть листівки, у клубі проводитимуться ігри, бесіди, творчої роботи, навчальні історії з тематикою \"Пригоди метелика\" ", "description": "", "url": "" },
        
        { "date": "2020-07-01 09:00:00", "title": "1-3 липня Тиждень Тварин. З нагоди Всесвітнього дня собак, що відзначається 2 липня, протягом початку липня та його першого тижня, у клубі \"Ріккі-Тіккі-Таві\" з дітьми проводитимуться бесіди, ігри, творчі роботи", "description": "", "url": "" },
        { "date": "2020-07-02 09:00:00", "title": "1-3 липня Тиждень Тварин. З нагоди Всесвітнього дня собак, що відзначається 2 липня, протягом початку липня та його першого тижня, у клубі \"Ріккі-Тіккі-Таві\" з дітьми проводитимуться бесіди, ігри, творчі роботи ", "description": "", "url": "" },
        { "date": "2020-07-03 09:00:00", "title": "1-3 липня Тиждень Тварин. З нагоди Всесвітнього дня собак, що відзначається 2 липня, протягом початку липня та його першого тижня, у клубі \"Ріккі-Тіккі-Таві\" з дітьми проводитимуться бесіди, ігри, творчі роботи ", "description": "", "url": "" },
        
        { "date": "2020-07-13 09:00:00", "title": "13-17.07.2020 Тиждень Миру.З нагоди Дня українського миротворця, що святкується 15 липня, протягом тижня будуть організовані ігри, бесіди та творча робота, де діти зможуть себе проявити у тематиці тижня. ", "description": "", "url": "" },
        { "date": "2020-07-14 09:00:00", "title": "13-17.07.2020 Тиждень Миру.З нагоди Дня українського миротворця, що святкується 15 липня, протягом тижня будуть організовані ігри, бесіди та творча робота, де діти зможуть себе проявити у тематиці тижня. ", "description": "", "url": "" },
        { "date": "2020-07-15 09:00:00", "title": "13-17.07.2020 Тиждень Миру.З нагоди Дня українського миротворця, що святкується 15 липня, протягом тижня будуть організовані ігри, бесіди та творча робота, де діти зможуть себе проявити у тематиці тижня. ", "description": "", "url": "" },
        { "date": "2020-07-16 09:00:00", "title": "13-17.07.2020 Тиждень Миру.З нагоди Дня українського миротворця, що святкується 15 липня, протягом тижня будуть організовані ігри, бесіди та творча робота, де діти зможуть себе проявити у тематиці тижня. ", "description": "", "url": "" },
        { "date": "2020-07-17 09:00:00", "title": "13-17.07.2020 Тиждень Миру.З нагоди Дня українського миротворця, що святкується 15 липня, протягом тижня будуть організовані ігри, бесіди та творча робота, де діти зможуть себе проявити у тематиці тижня. ", "description": "", "url": "" },
       

    ];
    $('#eventCalendar').eventCalendar({
        jsonData: data,
        eventsjson: 'data.json',
        jsonDateFormat: 'human',
        startWeekOnMonday: true,
        openEventInNewWindow: true,
        dateFormat: 'DD-MM-YYYY',
        showDescription: false,
        locales: {
            locale: "uk",
            txt_noEvents: "Відсутні заплановані події",
            txt_SpecificEvents_prev: "",
            txt_SpecificEvents_after: ":",
            txt_NextEvents: "Наступна подія:",
            txt_GoToEventUrl: "Дивитися",
            moment: {
                "months" : [ "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень",
                "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень" ],
                "monthsShort" : [ "Янв", "Фев", "Мар", "Апр", "Май", "Июн",
                "Июл", "Авг", "Сен", "Окт", "Ноя", "Дек" ],
                "weekdays" : [ "Неділя", "Понеділок","Вівторок","Середа","Четверг",
                "П'ятница","Суббота" ],
                "weekdaysShort" : [ "Нд","Пн","Вт","Ср","Чт",
                "Пт","Сб" ],
                "weekdaysMin" : [ "Нд","Пн","Вт","Ср","Чт",
                "Пт","Сб" ]
            }
        }
    });
});